src/Enums/СтатусыСертификатовНоменклатурыРосаккредитации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыСертификатовНоменклатурыРосаккредитации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИсключенИзРеестра</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аннулирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СведенияИзменены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выдан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Недействителен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИспорченИлиУтрачен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Использован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноПриостановлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приостановлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Действует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прекращен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Архивный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удален</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаправленоУведомлениеЗаявителюОПрекращении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыданоПредписание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возобновлен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/НоменклатураКлиентСерверЛокализация/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Заполняет значения реквизитов учета импорта и прослеживаемости по данным номенклатуры.
//
// Параметры:
//	Номенклатура - СправочникОбъект.Номенклатура, ДанныеФормыСтруктура - обрабатываемый элемент номенклатуры.
//	РеквизитыПрослеживаемости - см. НоменклатураКлиентСервер.РеквизитыПрослеживаемостиПоУмолчанию.
//
Процедура ЗаполнитьРеквизитыИмпортаИПрослеживаемости(Номенклатура, РеквизитыПрослеживаемости) Экспорт
	
	//++ Локализация
	СтранаПроисхожденияРФ = Номенклатура.СтранаПроисхождения = ПредопределенноеЗначение("Справочник.СтраныМира.Россия");
	
	Номенклатура.ПрослеживаемыйТовар = Не СтранаПроисхожденияРФ
										И РеквизитыПрослеживаемости.ПрослеживаемыйТовар;
	
	ЗаполнитьВестиУчетПоГТД(Номенклатура);
	//-- Локализация
	
	Возврат;
	
КонецПроцедуры

// Заполняет значение реквизита 'ВестиУчетПоГТД' по данным номенклатуры.
//
// Параметры:
//	Номенклатура - СправочникОбъект.Номенклатура, ДанныеФормыСтруктура - обрабатываемый элемент номенклатуры.
//
Процедура ЗаполнитьВестиУчетПоГТД(Номенклатура) Экспорт
	
	//++ Локализация
	СтранаПроисхожденияРФ = Номенклатура.СтранаПроисхождения = ПредопределенноеЗначение("Справочник.СтраныМира.Россия");
	
	Номенклатура.ВестиУчетПоГТД = Номенклатура.ПрослеживаемыйТовар
									Или Не СтранаПроисхожденияРФ
										И (ЗначениеЗаполнено(Номенклатура.СтранаПроисхождения)
											Или Номенклатура.ВестиУчетПоГТД);
	//-- Локализация
	
	Возврат;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИспользоватьСтатусСерийМожноУказать(Использовать, ПараметрыУказанияСерий) Экспорт
	
	//++ Локализация
	ИнтеграцияИСКлиентСерверПереопределяемый.ИспользоватьСтатусСерийМожноУказать(
		Использовать,
		ПараметрыУказанияСерий);
	//-- Локализация
	
КонецПроцедуры

#Область СертификатыНоменклатуры

// Возвращает коллекцию значений действующих статусов Росаккредитации.
//
// Возвращаемое значение:
//	Массив Из ПеречислениеСсылка - коллекцию значений действующих статусов Росаккредитации.
//
Функция ДействительныеСтатусыРосаккредитации() Экспорт
	
	Ответ = Новый Массив;
	//++ Локализация
	Ответ.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыСертификатовНоменклатурыРосаккредитации.Действует"));
	Ответ.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыСертификатовНоменклатурыРосаккредитации.Выдан"));
	Ответ.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыСертификатовНоменклатурыРосаккредитации.Новый"));
	Ответ.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыСертификатовНоменклатурыРосаккредитации.Продлен"));
	Ответ.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыСертификатовНоменклатурыРосаккредитации.Возобновлен"));
	Ответ.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыСертификатовНоменклатурыРосаккредитации.СведенияИзменены"));
	//-- Локализация
	
	Возврат Ответ;
	
КонецФункции

// Возвращает коллекцию значений недействующих статусов Росаккредитации.
//
// Возвращаемое значение:
//	Массив Из ПеречислениеСсылка - коллекцию значений недействующих статусов Росаккредитации.
//
Функция НедействительныеСтатусыРосаккредитации() Экспорт
	
	Ответ = Новый Массив;
	//++ Локализация
	Ответ.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыСертификатовНоменклатурыРосаккредитации.ИсключенИзРеестра"));
	Ответ.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыСертификатовНоменклатурыРосаккредитации.Аннулирован"));
	Ответ.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыСертификатовНоменклатурыРосаккредитации.Недействителен"));
	Ответ.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыСертификатовНоменклатурыРосаккредитации.ИспорченИлиУтрачен"));
	Ответ.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыСертификатовНоменклатурыРосаккредитации.Использован"));
	Ответ.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыСертификатовНоменклатурыРосаккредитации.Отменен"));
	Ответ.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыСертификатовНоменклатурыРосаккредитации.Приостановлен"));
	Ответ.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыСертификатовНоменклатурыРосаккредитации.Прекращен"));
	Ответ.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыСертификатовНоменклатурыРосаккредитации.Архивный"));
	Ответ.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыСертификатовНоменклатурыРосаккредитации.Черновик"));
	Ответ.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыСертификатовНоменклатурыРосаккредитации.Удален"));
	Ответ.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыСертификатовНоменклатурыРосаккредитации.НаправленоУведомлениеЗаявителюОПрекращении"));
	Ответ.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыСертификатовНоменклатурыРосаккредитации.ЧастичноПриостановлен"));
	Ответ.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыСертификатовНоменклатурыРосаккредитации.ВыданоПредписание"));
	Ответ.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыСертификатовНоменклатурыРосаккредитации.Отправлен"));
	//-- Локализация
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#КонецОбласти
